# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
# brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'hugo'
brew 'lastpass-cli'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'nginx'
brew 'php'
brew 'imagick'
brew 'mariadb'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
brew 'appcleaner'
brew 'autofirma'
cask 'caffeine'
cask 'firefox'
cask 'google-drive-file-stream'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'java'
cask 'lunar'
cask 'notion'
cask 'postman'
cask 'sequel-pro'
cask 'shuttle'
cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'tor-browser'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'watts'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-meslo-nerd-font-mono'
cask 'font-fira-code'

# Mac App Store
mas 'Deckset', id: 847496013
mas 'Monit', id: 1014850245
mas 'Pocket', id: 568494494
mas 'Serial', id: 877615577
mas 'Skitch', id: 425955336
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'TogglDesktop', id: 957734279
mas 'WhatsApp', id: 1147396723
